#ifndef _CLIENT_H_
#define _CLIENT_H_


/*====================================================================
        客户端重要的全局变量
====================================================================*/

/*====================================================================
结构体名:ConnectInfo
功能:保存与服务器实例连接的信息，便于后续直接通过该结构变量与服务器
实例通讯
====================================================================*/
struct ConnectInfo
{
    s32 dstnode;
    CMessage *pMsg;
};

extern struct ConnectInfo *g_pConnectInfo;

extern CUserInfo *pCltUserInfo;
/*====================================================================
        客户端相关函数声明
====================================================================*/
void UserInterface();           //操作菜单  




/*====================================================================
        客户端指令符号
====================================================================*/

#define U_INVALID     (u16)(1)
#define U_CATOTHERS   (u16)(2)
#define U_TRANSINFO   (u16)(3)
#define U_TRANSALL    (u16)(4)
#define U_SENDFILE    (u16)(5)
#define U_SENDCHAR    (u16)(6)
#define U_DISCONNECT  (u16)(7)
#define U_CLEAR       (u16)(0)




#endif  //client.h



